;;°ж±ѕ:V1.4.1ZE_RC27m4 LCD:3 ';'єуГжЅУµДКЗЧўКН
M8000 I1;¶Пµз±ЈґжЦ§іЦУл·с
M8001 I1;ёґО»їЄН·Ц§іЦУл·с
M8002 I-1;Xµз»ъ·ЅПт
M8003 I-1;Yµз»ъ·ЅПт
M8004 I1;Zµз»ъ·ЅПт
M8005 I-1;Eµз»ъ·ЅПт
M8005 I1 E2;E2µз»ъ·ЅПт
M8005 I1 E3;E3µз»ъ·ЅПт
M8005 X0 ;XЦб 0:ј·іцН·¶Ї 1:ЖЅМЁ¶Ї
M8005 Y0 ;YЦб 0:ј·іцН·¶Ї 1:ЖЅМЁ¶Ї
M8005 Z1 ;ZЦб 0:ј·іцН·¶Ї 1:ЖЅМЁ¶Ї
;M8006 I120;ЖрКјЛЩ¶И
M8006 I120
M8007 I25;№мНдЛЩ¶И
M8008 I350;јУЛЩ¶И
;M8007 E20;E№мНдЛЩ¶И
;M8008 E1800;EјУЛЩ¶И
;M8009 S0.006250;x,yГїІЅmm
M8009 S0.003125
;M8010 S0.001250;zГїІЅmm
M8010 S0.000625
;M8011 S0.001308;eГїІЅmm
;M8011 S0.001
M8011 S0.00045
M8012 I120;XYЧоґуЛЩ¶И
M8013 I20;ZЧоґуЛЩ¶И
M8014 I120;EЧоґуЛЩ¶И
M8015 I8;ZµЪТ»ґО№йБгЛЩ¶И
M8016 I8;ZµЪ¶юґО№йБгЛЩ¶И
M8015 S40;XYµЪТ»ґО№йБгЛЩ¶И
M8016 S20;XYµЪ¶юґО№йБгЛЩ¶И
M8017 I6;Ф¤ј·іці¤¶И
M8018 I120;Ф¤ј·іцЧоґуЛЩ¶И
M8019 I50;MakerwareНЛЛїЛЩ¶И
M8020 S1.500000;MakerwareНЛЛїі¤¶И
;M8020 S0.0
M8033 S0.000000;MakerwareЗР»»ј·іцН·НЛЛїі¤¶И
M8021 S1.750000;єДІДЦ±ѕ¶
M8022 I275;ј·іцН·ЧоёЯОВ¶И
M8022 T170;єДІДЧоµНј·іцОВ¶И
M8023 I100;ИИґІЧоёЯОВ¶И
M8023 T0;ОВ¶ИѕЇёжК№ДЬ 0:К№ДЬ 1:ЅыЦ№
M8024 I330;XЧоґуРРіМ
M8025 I330;YИЎґуРРіМ
M8026 I400.000000;ZЧоґуРРіМ
M8027 I1;ј·іцН·ёцКэ
M8027 S0;¶аЅшТ»іцЕзН· 1:КЗ 0:І»КЗ
;M8027 Z0;Ѕ«E2µ±іЙЛ«ZЦбµДБнТ»ёцЦб
;M8027 Y0;Ѕ«E2µ±іЙЛ«YЦбµДБнТ»ёцЦб
;M8027 E0;Ѕ«E2µ±іЙЛ«E1Цб
M8027 T1;0:ЅыЦ№ИИґІ  1:К№ДЬИИґІ
M8028 S0.000000;НЛЛїІ№іҐ
M8029 I0;XYПЮО» 0:ЧоРЎПЮО» 1ЈєЧоґуПЮО» 2:Л«±ЯПЮО» 3:Чуєу 4:УТЗ°
M8029 T0;ПЮО»ЅУПЯ 0:ПЮО»іЈїЄ 1:ПЮО»іЈ±Х
M8029 S0;ZПЮО»АаРН 0:ЧоРЎПЮО» 1:ЧоґуПЮО»
M8029 C0;XYZ№йО»єу¶ЇЧч 0:»ШБгµг(0,0,0) 1:НЈФЪПЮО»О»ЦГ
M8029 P-1;filament(ИэЅЗЦЮµчЖЅ)ПЮО»;1:УлXYZПЮО»АаРНПаН¬   -1:УлXYZПЮО»АаРНПа·ґ
M8029 D1;єДІДјмІвК№ДЬ
M8030 I0;·зЙИЧФЖф¶ЇОВ¶И
M8030 I50 T-1;Цч°е·зЙИЧФЖфОВ¶ИЈ¬іЈїЄЙиЦГОЄБг
M8031 S0.000000;µЪ¶юј·іцН·XЖ«ТЖ
M8032 S0.000000;µЪ¶юј·іцН·YЖ«ТЖ
M8031 D0.000000;µЪИэј·іцН·XЖ«ТЖ
M8032 D0.000000;µЪИэј·іцН·YЖ«ТЖ
M8034 I1;ОДјюјРЦ§іЦУл·с
M8035 I7;µчЖЅµгёцКэ
;M8036 X0.1 Y0.1;¶аЙЩёцµгѕНМо¶аЙЩёцЧш±кЈ¬РЎУЪ0ОЄРРіМ±ИАэЈ¬·сФтОЄЧш±к
M8036 X10.0000 Y10.0000;µчЖЅО»ЦГ
M8036 X60.0000 Y50.0000;µчЖЅО»ЦГ
M8036 X300.0000 Y300.0000;µчЖЅО»ЦГ
M8036 X60.0000 Y300.0000;µчЖЅО»ЦГ
M8036 X300.0000 Y300.0000;µчЖЅО»ЦГ
M8036 X60.0000 Y50.0000;µчЖЅО»ЦГ
M8036 X300.0000 Y50.0000;µчЖЅО»ЦГ
M8080 I2;»ъРНАаРН 0:XYZ 1:Delta 2:Hbot
M8081 I2;ОВ¶Иґ«ёРЖч 0: NTC 100K 1 B  1:KРНИИµзЕј 2:EPCOS NTCИИЧи
M8083 S180.000000;ИэЅЗЦЮёЛі¤¶И
M8083 Z200.000000;ИэЅЗЦЮZРРіМ
;M8083 I2;КЗ·сК№ДЬЧФ¶ЇµчЖЅ
M8083 D0 P0;¶ж»ъЖрКјЅЗ¶ИєНЅбКшЅЗ¶И
M8084 S80.000000;ИэЅЗЦЮґтУЎ°лѕ¶ 
M8084 D0;µчЖЅ°лѕ¶ІоЦµ
M8084 P0;µчЖЅИЎµгДЈКЅ,0:7x7Хэ·ЅїЄ 1:37ёцµгЈ¬ХэБщ±ЯРО
M8084 Z3.999996;ИэЅЗЦЮZЖ«ТЖЈ¬0:ЅыЦ№Ж«ТЖЈ¬РРіМУЙЙиZОЄБгИ·¶ЁЈ¬·З0Ј¬РРіМУЙµчЖЅґҐ·ўЖчґҐ·ўО»ЦГ+Ж«ТЖЦµ
M8085 I6000;їЄ»ъlogoіЦРшК±јдЈ¬ЧоРЎ100ms,Чоґу6000ms
M8085 T0;ЖБ±Јґэ»ъµИґэК±јд,µҐО»КЗГл
M8085 P0;ґэ»ъ¶аі¤К±јдєу№Ш»ъ
;M8086 I1 ;µз»ъПё·ЦИнјю·ЦЖµ,І»¶®ЗлЙи1
M8086 I2 ;µз»ъПё·ЦИнјю·ЦЖµ,І»¶®ЗлЙи1
M8087 I0 T8000;I:·ЅПтУРР§µЅВціеУРР§µДК±јд(ns),T:ВціеЧо¶М±ЈіЦК±јд(ns).Из№ыГ»УРНвЅУЗэ¶ЇЈ¬ЗлИ«ІїЙиОЄ0
M8089 P0 ;;КЗ·сґтУЎНкіЙєуЈ¬ЗїЦЖ№Ш±ХЛщУРµз»ъј°јУИИ    	 0Јє№Ш±ХЛщУР  1ЈєґтУЎНкєуІ»ФЛЧч  2:ґтУЎНк№эБг
M301 P22.2000 I1.0800 D114.0000;ОВ¶ИPIDІОКэ
M8489	I256	;Цч°е·зЙИЧФЖфК±µДpwm±ИАэ
M8489	T3	;Ч°ФШєДІДµДЅшЛїЛЩ¶И
M8489	S5	;ИэЅЗЦЮ»ъРНФЪµчЖЅК±Ј¬ИЎµгК±µДПВЅµЛЩ¶И
;M8520 I0;ј¤№вµсїМЦ§іЦЈ¬»бЦШ¶ЁПтmoreµД№¦ДЬЈ¬Д¬ИПЅыЦ№ 1:Ц§іЦ 0:І»Ц§іЦ
;M8520 T0;КЦ¶ЇµчЖЅЦ§іЦЈ¬Д¬ИПЅыЦ№  1:Ц§іЦ 0:І»Ц§іЦ
;M8521 I0;ИИґІјУИИЦШ¶ЁТеЈ¬Д¬ИПОЄ0
M8500		;±ЈґжЕдЦГ
